# month_number = input('Введите номер месяца: ')
month_number = '5'
seasons_in_list = ['зима', 'зима',  'весна', 'весна', 'весна', 'лето',
                   'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
seasons_in_dict = {
    '12': "зима",
    '1': "зима",
    '2': "зима",
    '3': "весна",
    '4': "весна",
    '5': "весна",
    '6': "лето",
    '7': "лето",
    '8': "лето",
    '9': "осень",
    '10': "осень",
    '11': "осень",

}
print(seasons_in_list[int(month_number) - 1])
print(seasons_in_dict[month_number])